SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( LJ_ExGW_Railcar

Comment ( ******************** General Information **********************
                Included in this section - Type, Shape, Size, Mass, etc
         *************************************************************** )

Type ( Engine )
WagonShape ( LJ_ExGW_Railcar.s )
Size ( 2.718m 3.713m 20.049m )
Mass ( 37t-uk ) Comment ( * Tare 35.65t-uk, 48 seats *)
ORTSNumberAxles ( 2 ) Comment ( * 2 unpowered axles * )
WheelRadius ( 19in )

 Comment ( ************************* Coupler Information ************************
                Included in this section - Type, Spring, Buffer, Velocity, etc
         ********************************************************************** )

   Coupling (
     Type ( chain )
       Spring (
        Stiffness ( 1e6N/m 5e6N/m )
        Break ( 1220kN 1220kN )
        r0 ( -5cm 0cm )))


Comment ( ******************************* Brakes *********************************************
                Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc
         ************************************************************************************ )

BrakeEquipmentType ( Vacuum_brake, Auxilary_reservoir, Handbrake )
BrakeSystemType ( Vacuum_single_pipe )
MaxBrakeForce ( 73kN )    Comment ( * guess * )
MaxHandbrakeForce ( 25kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )
BrakePipeVolume ( 1.33ft^3 )
ORTSBrakeCylinderSize ( 18in )
ORTSNumberBrakeCylinders ( 2 )
ORTSAuxilaryResCapacity ( 6.48ft^3 )
MaxReleaseRate ( 5.0 )
MaxApplicationRate ( 5.0 )
ORTSDirectAdmissionValve ( 1 )

ORTSBrakeShoeFriction ( 0 0.31 1 0.30 2 0.28 3 0.27 4 0.26 5 0.25 7 0.24 8 0.23 9 0.22 12 0.21 14 0.20 17 0.19 20 0.18 24 0.17 29 0.16 34 0.15 40 0.14 47 0.13 55 0.12 66 0.11 84 0.10 115 0.09 160 0.09 ) 
Comment ( cast iron brake shoes )

Comment ( **************** Resistance & SuperElevation **************************
                Included in this section - Wheelbase, gauge, etc
         *********************************************************************** )

ORTSBearingType ( Roller )
ORTSDavis_A ( 695 )        Comment ( * Estimate based on extra mechanical resistance of transmission * )
ORTSDavis_B ( 26.3 )
ORTSDavis_C ( 3.14 )        Comment ( * Estimate based on SNCF calculation of resistance for locomotives * )

ORTSWagonFrontalArea ( 90ft^2 ) Comment ( * Estimate based on dimensions * )
ORTSDavisDragConstant ( 0.0016 )
ORTSTrailLocomotiveResistanceFactor ( 0.318 ) Comment ( * Ratio of SNCF calculated resistances * )

CentreOfGravity ( 0m 1.977m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelBase ( 8ft 6in )

Comment ( ************************ Lights (If used) ***********************************
                Included in this section - Type, Colour, Location, Size, Control, etc
         ***************************************************************************** )

      Lights	( 14
		Light	(
			comment( Main Head Light - BRIGHT )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcccc )
					Position ( 0.0 1.906 9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment( Marker Light Dim Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( 0.864 1.343 9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment( Marker Light Bright Left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( 0.864 1.343 9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment( Marker Light Dim Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( -0.864 1.343 9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment( Marker Light Bright Right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( -0.864 1.343 9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)

		Light	(
			comment( Tail Light DIM )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eecc0000 )
					Position ( 0.0 3.352 -9.08 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.50 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment( Tail Light BRIGHT )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffcc0000 )
					Position ( 0.0 3.352 -9.08 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.50 )
					Elevation ( 0 0 0 )
                              )
                        )
                 )
           Light (
			comment ( Main Head Light - BRIGHT opp direction of travel  )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcccc )
					Position ( 0.0 1.906 -9.559 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment ( Marker Light Dim Left opp direction of travel  )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( -0.864 1.343 -9.559 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment ( Marker Light Bright Left opp direction of travel )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( -0.864 1.343 -9.559 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment ( Marker Light Dim Right opp direction of travel )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( 0.864 1.343 -9.559 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment ( Marker Light Bright Right opp direction of travel  )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eeffcc66 )
					Position ( 0.864 1.343 -9.559 )
					Azimuth ( -180 -180 -180  )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0 0 0 )
					)
				)
			)
	
		Light	(
			comment ( Tail Light DIM opp direction of travel  )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eecc0000 )
					Position ( 0.0 3.352 9.08 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.50 )
					Elevation ( 0 0 0 )
					)
				)
			)
		Light	(
			comment ( Tail Light BRIGHT opp direction of travel )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffcc0000 )
					Position ( 0.0 3.352 9.08 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.50 )
					Elevation ( 0 0 0 )
					)
				)
			)
		)
		
Comment ( ******************** Freight Animations (If used) *******************
                Included in this section - Freight Animation information, etc
         ********************************************************************* )

Comment ( ********************* Passenger View (If used) ******************
                Included in this section - File, Location, Direction, etc
         ***************************************************************** )

    Inside (
              PassengerCabinFile ( LJ_ExGW_Railcar.s )
              PassengerCabinHeadPos ( 0.88 2.53 -3.444 )
              RotationLimit ( 50 100  0 )
              StartDirection ( 0 0 0 )
              Sound ( "..\\..\\common.sound\\1st Gen DMU\\DMUeng.sms" )
      )


Comment ( ********************** Micellaneous Information **********
                      Included in this section - Name, Sounds, etc
          ********************************************************* )

IntakePoint ( 3.33 0.4 FuelDiesel )
PassengerCapacity ( 48 )
Sound ( "..\\..\\common.sound\\1st Gen DMU\\DMUeng.sms" )
)

Engine ( LJ_ExGW_Railcar

Effects  (
DieselSpecialEffects (

Exhaust1 (
0.60 3.66 -3.76
0.001 0.01 0
0.2 )
Exhaust2 (
-0.60 3.66 -3.76
-0.001 0.01 0
0.2 )

) )

Wagon ( LJ_ExGW_Railcar )

Comment (************************ General Information ****************
                      Included in this section - Wheels, sanding, etc
          ************************************************)

Type ( Diesel )
WheelRadius ( 19in )
ORTSNumberDriveAxles ( 2 ) Comment ( * two axles powered * )
Sanding ( 10mph )
ORTSDriveWheelWeight ( 18.5t-uk )

Comment (************************ Diesel Engine ****************)

MaxDieselLevel( 180g-uk )
MaxVelocity ( 40mph )

Comment ( Car 1 60mph, Cars2-17 80mph, Cars19-20 40or60mph, Car18 and Cars21-33 40mph, Cars35-38 70mph )
Comment ( Car 1 130hp @ 2000rpm, Cars2-17 2x130hp @ 2000rpm, Cars18-38 2x105hp @ 1600rpm )

Comment ( estimated data for AEC 9.6L direct injection engine with governor set to 1600rpm )

ORTSDieselEngines ( 2
Diesel(
IdleRPM	( 500 )
MaxRPM	( 1600 )
StartingRPM	( 300 )
StartingConfirmRPM	( 400 )
ChangeUpRPMpS	( 90 )
ChangeDownRPMpS	( 240 )
RateOfChangeUpRPMpSS	( 60 )
RateOfChangeDownRPMpSS	( 60 )
MaximalPower  ( 105hp )
IdleExhaust ( 6.25 ) Comment ( 4-stroke = rpm / 80 )
MaxExhaust ( 20.0 ) Comment ( 4-stroke = rpm / 80 )
ExhaustDynamics	( 1.2 )
ExhaustDynamicsDown	( 0.3 )
ExhaustColor	( 408C9094 )
ExhaustTransientColor	( 7F6B787D )
DieselPowerTab (
0	0
500	3525
1000	44100
1200	57264
1400	68676
1600	78336
1800	64736
 )
DieselConsumptionTab (
0	0
500	6
1000	8
1200	11
1400	15
1600	19
 )
ThrottleRPMTab (
0	500
15	600
50	1200
70	1400
100	1600
 )
DieselTorqueTab (
0	0
500	67
1000	421
1200	455
1400	468
1600	467
1800	343
 )
MinOilPressure	( 40 )
MaxOilPressure	( 90 )
MaxTemperature	( 120 )
Cooling	( 3 )
TempTimeConstant ( 720 )
OptTemperature	( 90 )
IdleTemperature	( 70 )
 )		
Diesel(
IdleRPM	( 500 )
MaxRPM	( 1600 )
StartingRPM	( 300 )
StartingConfirmRPM	( 400 )
ChangeUpRPMpS	( 90 )
ChangeDownRPMpS	( 240 )
RateOfChangeUpRPMpSS	( 60 )
RateOfChangeDownRPMpSS	( 60 )
MaximalPower  ( 105hp )
IdleExhaust ( 6.25 ) Comment ( 4-stroke = rpm / 80 )
MaxExhaust ( 20.0 ) Comment ( 4-stroke = rpm / 80 )
ExhaustDynamics	( 1.2 )
ExhaustDynamicsDown	( 0.3 )
ExhaustColor	( 408C9094 )
ExhaustTransientColor	( 7F6B787D )
DieselPowerTab (
0	0
500	3525
1000	44100
1200	57264
1400	68676
1600	78336
1800	64736
 )
DieselConsumptionTab (
0	0
500	6
1000	8
1200	11
1400	15
1600	19
 )
ThrottleRPMTab (
0	500
15	600
50	1200
70	1400
100	1600
 )
DieselTorqueTab (
0	0
500	67
1000	421
1200	455
1400	468
1600	467
1800	343
 )
MinOilPressure	( 40 )
MaxOilPressure	( 90 )
MaxTemperature	( 120 )
Cooling	( 3 )
TempTimeConstant ( 720 )
OptTemperature	( 90 )
IdleTemperature	( 70 )
 )
)

Comment ( ********** Gearbox ************* )

Comment ( Cars 18 and 21 to 33 geared to 40 mph max )

 DieselEngineType ( mechanical )

 GearBoxNumberOfGears( 4 )
 GearBoxDirectDriveGear( 4 )
 GearBoxMaxSpeedForGears( 9.6 16.9 26.8 40 )
 GearBoxMaxTractiveForceForGears( 33950N 19231N 11942N 8541N )
 GearBoxOverspeedPercentageForFailure( 120 )
 GearBoxOperation( manual )
 GearBoxEngineBraking( none )

Comment ( *************************** Brake System *********************************************
                      Included in this section - Compressor, Reservoir, Application rates, etc
         ************************************************************************************** )

Comment ( *** Braking systems *** )
    BrakesTrainBrakeType( vacuum_single_pipe )
    ORTSBrakeServiceTimeFactor ( 120 )
    ORTSBrakePipeTimeFactor ( 0.01 )
    TrainPipeLeakRate ( 0.04 )

    Comment ( *** Exhausters *** )
    ORTSBrakePipeChargingRate ( 0.20 )

Comment ( *** Brake Valve Combined *** )
    TrainBrakesControllerMaxReleaseRate ( 2 )
    TrainBrakesControllerMaxApplicationRate( 1 )
    TrainBrakesControllerMaxSystemPressure ( 21inHg )

Comment ( ******************* Train Control Systems (If used) ***********************************************
                      Included in this section - Monitoring of Overspeed, Emergency Braking, Vigilance, etc
         *************************************************************************************************** )



Comment ( ************************** Engine Controls **********************************************
                      Included in this section - Controllers for Regulator, Reverser, Brakes, etc
         ***************************************************************************************** )

 DoesHornTriggerBell( 0 )
 
 EngineControllers (

 Throttle ( 0 1 0.1 0 NumNotches ( 0 ) )

Brake_Train ( 0 1 0.1 0.2
 NumNotches ( 3
  Notch( 0.0  0 TrainBrakesControllerReleaseStart ) Comment ( RUNNING )
  Notch( 0.2  0 TrainBrakesControllerHoldLappedStart ) Comment ( LAP )
  Notch ( 0.4  1 TrainBrakesControllerVacuumApplyContinuousServiceStart ) Comment ( APPLY ) ) )

    DirControl ( -1 0 1 1 )
    AWS ( 0 1 0 )
    Sanding ( 0 1 0 )
    Horn ( 0 1 0 )
    Wipers ( 0 1 0 )
 
    Gear( 0 4 1 0
             NumNotches ( 5
                Notch ( 0         0 Dummy )
                Notch ( 1         0 Dummy )
                Notch ( 2         0 Dummy )
                Notch ( 3         0 Dummy )
                Notch ( 4         0 Dummy )))
 
   Headlights ( 0 0.25 1 0 )
   )


 Comment (********************** Micellaneous Information ****************************
                      Included in this section - Alternate Views, Sounds, Names, etc
         ****************************************************************************)


CabView ( GW_Railcar.cvf )
Sound ( Sound ( "..\\..\\common.sound\\1st Gen DMU\\DMUcab.sms" )
Name ( "RF_ExGW_Railcar" )

	Description (
 	""

	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+  
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1.	Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	)
)